#                                     PANDAS

What is Pandas?

Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

Why Use Pandas?

Pandas allows us to analyze big data and make conclusions based on statistical theories.

Pandas can clean messy data sets, and make them readable and relevant.

Relevant data is very important in data science.

What Can Pandas Do?

Pandas gives you answers about the data. Like:

> Is there a correlation between two or more columns?

> What is average value?

> Max value?

> Min value?

Pandas are also able to delete rows that are not relevant, or contains wrong values, 

like empty or NULL values. This is called cleaning the data.

In [1]:
import pandas

mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pandas.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [2]:
import pandas as pd

print(pd.__version__)

1.2.4

# Pandas Series

In [4]:
#A Pandas Series is like a column in a table.
#It is a one-dimensional array holding data of any type.

import pandas as pd

a = [1, 7, 2]

myvar = pd.Series(a)

print(myvar)
print(myvar[0])

0    1
1    7
2    2
dtype: int64
1

# Create Labels

In [6]:
#With the index argument, you can name your own labels.

a=[1,7,2]
myvar=pd.Series(a,index=["x","y","z"])
print(myvar)

#When you have created labels, you can access an item by referring to the label.

print(myvar["y"])

x    1
y    7
z    2
dtype: int64
7

# Key/Value Objects as Series

In [8]:
#You can also use a key/value object, like a dictionary, when creating a Series.

calories={"day1":420,"day2":380,"day3":390}
#The keys of the dictionary become the labels.

v=pd.Series(calories)
print(v)
print()
print(calories)

day1    420
day2    380
day3    390
dtype: int64

{'day1': 420, 'day2': 380, 'day3': 390}

In [13]:
#To select only some of the items in the dictionary, 
#use the index argument and specify only the items 
#you want to include in the Series.
import pandas as pd
v=pd.Series(calories,index=['day1','day2'])
print(v)

day1    420
day2    380
dtype: int64

# DataFrames

What is a DataFrame?

A Pandas DataFrame is a 2 dimensional data structure, 

like a 2 dimensional array, or a table with rows and columns.

In [25]:
import pandas as p

df = p.read_csv("SampleCSVFile_2kb.csv")
df

,1,"Eldon Base for stackable storage shelf, platinum",Muhammed MacIntyre,3,-213.25,38.94,35,Nunavut,Storage & Organization,0.8
0,2,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",Barry French,293,457.81,208.16,68.02,Nunavut,Appliances,0.58
1,3,"Cardinal Slant-D� Ring Binder, Heavy Gauge Vinyl",Barry French,293,46.71,8.69,2.99,Nunavut,Binders and Binder Accessories,0.39
2,4,R380,Clay Rozendal,483,1198.97,195.99,3.99,Nunavut,Telephones and Communication,0.58
3,5,Holmes HEPA Air Purifier,Carlos Soltero,515,30.94,21.78,5.94,Nunavut,Appliances,0.50
4,6,G.E. Longer-Life Indoor Recessed Floodlight Bulbs,Carlos Soltero,515,4.43,6.64,4.95,Nunavut,Office Furnishings,0.37
5,7,"Angle-D Binders with Locking Rings, Label Holders",Carl Jackson,613,-54.04,7.30,7.72,Nunavut,Binders and Binder Accessories,0.38
6,8,"SAFCO Mobile Desk Side File, Wire Frame",Carl Jackson,613,127.70,42.76,6.22,Nunavut,Storage & Organization,NaN
7,9,"SAFCO Commercial Wire Shelving, Black",Monica Federle,643,-695.26,138.14,35.00,Nunavut,Storage & Organization,NaN
8,10,Xerox 198,Dorothy Badders,678,-226.36,4.98,8.33,Nunavut,Paper,0.38

In [30]:
weather_data = {
    'Day': ['1/1/2001','1/2/2001','1/3/2001','1/4/2001','1/5/2001','1/6/2001'],
    'Temperature' : [32,33,44,35,38,40],
    'Wind Speed' : [6,4,2,8,5,3],
    'Event' : ['Rain','Tornendo','Storm','Thunder','Sunshine','Thunderstorm'],
}

df = pd.DataFrame(weather_data)
df

        Day  Temperature  Wind Speed         Event
0  1/1/2001           32           6          Rain
1  1/2/2001           33           4      Tornendo
2  1/3/2001           44           2         Storm
3  1/4/2001           35           8       Thunder
4  1/5/2001           38           5      Sunshine
5  1/6/2001           40           3  Thunderstorm

In [33]:
df.shape   #It'll print the dimensions of the above table

(6, 4)

In [36]:
rows , coloumns = df.shape
print("ROWS: ",rows)
print("COLOUMNS: ",coloumns)

ROWS:  6
COLOUMNS:  4

In [38]:
df.head()  #Prints start 5 rows data

        Day  Temperature  Wind Speed     Event
0  1/1/2001           32           6      Rain
1  1/2/2001           33           4  Tornendo
2  1/3/2001           44           2     Storm
3  1/4/2001           35           8   Thunder
4  1/5/2001           38           5  Sunshine

In [40]:
df.head(3)   #Prints rows u want to print

        Day  Temperature  Wind Speed     Event
0  1/1/2001           32           6      Rain
1  1/2/2001           33           4  Tornendo
2  1/3/2001           44           2     Storm

In [41]:
df.tail()  #Print last 5 rows data

        Day  Temperature  Wind Speed         Event
1  1/2/2001           33           4      Tornendo
2  1/3/2001           44           2         Storm
3  1/4/2001           35           8       Thunder
4  1/5/2001           38           5      Sunshine
5  1/6/2001           40           3  Thunderstorm

In [42]:
df.tail(2)  #Print last 2 rows data

        Day  Temperature  Wind Speed         Event
4  1/5/2001           38           5      Sunshine
5  1/6/2001           40           3  Thunderstorm

In [43]:
#SLICING AND INDEXING

df[2:5]

        Day  Temperature  Wind Speed     Event
2  1/3/2001           44           2     Storm
3  1/4/2001           35           8   Thunder
4  1/5/2001           38           5  Sunshine

In [44]:
df[:3]

        Day  Temperature  Wind Speed     Event
0  1/1/2001           32           6      Rain
1  1/2/2001           33           4  Tornendo
2  1/3/2001           44           2     Storm

In [48]:
#PRINTING THE COLOUMNS ONLY

df.columns

Index(['Day', 'Temperature', 'Wind Speed', 'Event'], dtype='object')

In [50]:
#PRINTING AN INDIVIDUAL COLUMN

df.Temperature  #df['Temperature']

0    32
1    33
2    44
3    35
4    38
5    40
Name: Temperature, dtype: int64

In [51]:
df['Temperature']

0    32
1    33
2    44
3    35
4    38
5    40
Name: Temperature, dtype: int64

In [52]:
type(df['Temperature'])

pandas.core.series.Series

In [53]:
df[['Event','Day']]

          Event       Day
0          Rain  1/1/2001
1      Tornendo  1/2/2001
2         Storm  1/3/2001
3       Thunder  1/4/2001
4      Sunshine  1/5/2001
5  Thunderstorm  1/6/2001

In [54]:
df.max()

Day            1/6/2001
Temperature          44
Wind Speed            8
Event          Tornendo
dtype: object

In [57]:
df['Wind Speed'].max()

8

In [58]:
df.min()

Day            1/1/2001
Temperature          32
Wind Speed            2
Event              Rain
dtype: object

In [59]:
df

        Day  Temperature  Wind Speed         Event
0  1/1/2001           32           6          Rain
1  1/2/2001           33           4      Tornendo
2  1/3/2001           44           2         Storm
3  1/4/2001           35           8       Thunder
4  1/5/2001           38           5      Sunshine
5  1/6/2001           40           3  Thunderstorm

In [61]:
df.mean()

Temperature    37.000000
Wind Speed      4.666667
dtype: float64

In [62]:
df.std()

Temperature    4.560702
Wind Speed     2.160247
dtype: float64

In [63]:
df.describe()

       Temperature  Wind Speed
count     6.000000    6.000000
mean     37.000000    4.666667
std       4.560702    2.160247
min      32.000000    2.000000
25%      33.500000    3.250000
50%      36.500000    4.500000
75%      39.500000    5.750000
max      44.000000    8.000000

In [69]:
df[df.Temperature==df.Temperature.max()]

        Day  Temperature  Wind Speed  Event
2  1/3/2001           44           2  Storm

In [72]:
df[['Day','Temperature']][df.Temperature==df.Temperature.max()]

        Day  Temperature
2  1/3/2001           44

In [73]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [75]:
df.set_index('Day')

          Temperature  Wind Speed         Event
Day
1/1/2001           32           6          Rain
1/2/2001           33           4      Tornendo
1/3/2001           44           2         Storm
1/4/2001           35           8       Thunder
1/5/2001           38           5      Sunshine
1/6/2001           40           3  Thunderstorm

In [76]:
df.loc[df.Day=='1/2/2001']

        Day  Temperature  Wind Speed     Event
1  1/2/2001           33           4  Tornendo

In [78]:

dff = df.set_index('Day')
dff

          Temperature  Wind Speed         Event
Day
1/1/2001           32           6          Rain
1/2/2001           33           4      Tornendo
1/3/2001           44           2         Storm
1/4/2001           35           8       Thunder
1/5/2001           38           5      Sunshine
1/6/2001           40           3  Thunderstorm

In [79]:
dff.loc['1/2/2001']

Temperature          33
Wind Speed            4
Event          Tornendo
Name: 1/2/2001, dtype: object

In [81]:
dff= df.reset_index
dff

<bound method DataFrame.reset_index of         Day  Temperature  Wind Speed         Event
0  1/1/2001           32           6          Rain
1  1/2/2001           33           4      Tornendo
2  1/3/2001           44           2         Storm
3  1/4/2001           35           8       Thunder
4  1/5/2001           38           5      Sunshine
5  1/6/2001           40           3  Thunderstorm>

In [83]:
df

        Day  Temperature  Wind Speed         Event
0  1/1/2001           32           6          Rain
1  1/2/2001           33           4      Tornendo
2  1/3/2001           44           2         Storm
3  1/4/2001           35           8       Thunder
4  1/5/2001           38           5      Sunshine
5  1/6/2001           40           3  Thunderstorm

# Pandas Read JSON

Read JSON

Big data sets are often stored, or extracted as JSON.

JSON is plain text, but has the format of an object, and is well known in the world of programming, including Pandas.

#Dictionary as JSON

JSON = Python Dictionary

JSON objects have the same format as Python dictionaries.

If your JSON code is not in a file, but in a Python Dictionary, you can load it into a DataFrame directly:

In [86]:
import pandas as pd

data = {
  "Duration":{
    "0":60,
    "1":60,
    "2":60,
    "3":45,
    "4":45,
    "5":60
  },
  "Pulse":{
    "0":110,
    "1":117,
    "2":103,
    "3":109,
    "4":117,
    "5":102
  },
  "Maxpulse":{
    "0":130,
    "1":145,
    "2":135,
    "3":175,
    "4":148,
    "5":127
  },
  "Calories":{
    "0":409,
    "1":479,
    "2":340,
    "3":282,
    "4":406,
    "5":300
  }
}


print(data)
print()
df = pd.DataFrame(data)
print(df)

{'Duration': {'0': 60, '1': 60, '2': 60, '3': 45, '4': 45, '5': 60}, 'Pulse': {'0': 110, '1': 117, '2': 103, '3': 109, '4': 117, '5': 102}, 'Maxpulse': {'0': 130, '1': 145, '2': 135, '3': 175, '4': 148, '5': 127}, 'Calories': {'0': 409, '1': 479, '2': 340, '3': 282, '4': 406, '5': 300}}

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

In [87]:
df.max()

Duration     60
Pulse       117
Maxpulse    175
Calories    479
dtype: int64

In [88]:
df.describe()

        Duration       Pulse    Maxpulse    Calories
count   6.000000    6.000000    6.000000    6.000000
mean   55.000000  109.666667  143.333333  369.333333
std     7.745967    6.501282   17.557525   75.152290
min    45.000000  102.000000  127.000000  282.000000
25%    48.750000  104.500000  131.250000  310.000000
50%    60.000000  109.500000  140.000000  373.000000
75%    60.000000  115.250000  147.250000  408.250000
max    60.000000  117.000000  175.000000  479.000000

# Pandas - Analyzing DataFrames

In [89]:
#Info About the Data

print(df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  6 non-null      int64
 1   Pulse     6 non-null      int64
 2   Maxpulse  6 non-null      int64
 3   Calories  6 non-null      int64
dtypes: int64(4)
memory usage: 240.0+ bytes
None

In [95]:
df = p.read_csv("data.csv")
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [96]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

In [100]:
df=p.read_excel('SampleXLSFile_38kb.xls')
df

,1,"Eldon Base for stackable storage shelf, platinum",Muhammed MacIntyre,3,-213.25,38.94,35,Nunavut,Storage & Organization,0.8
0,2,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",Barry French,293,457.8100,208.16,68.02,Nunavut,Appliances,0.58
1,3,"Cardinal Slant-D® Ring Binder, Heavy Gauge Vinyl",Barry French,293,46.7075,8.69,2.99,Nunavut,Binders and Binder Accessories,0.39
2,4,R380,Clay Rozendal,483,1198.9710,195.99,3.99,Nunavut,Telephones and Communication,0.58
3,5,Holmes HEPA Air Purifier,Carlos Soltero,515,30.9400,21.78,5.94,Nunavut,Appliances,0.50
4,6,G.E. Longer-Life Indoor Recessed Floodlight Bulbs,Carlos Soltero,515,4.4300,6.64,4.95,Nunavut,Office Furnishings,0.37
...,...,...,...,...,...,...,...,...,...,...
94,96,"Linden® 12"" Wall Clock With Oak Frame",Doug Bickford,10535,-44.1400,33.98,19.99,Northwest Territories,Office Furnishings,0.55
95,97,Newell 326,Doug Bickford,10535,-0.7900,1.76,0.70,Northwest Territories,Pens & Art Supplies,0.56
96,98,Prismacolor Color Pencil Set,Jamie Kunitz,10789,76.4200,19.84,4.10,Northwest Territories,Pens & Art Supplies,0.44
97,99,Xerox Blank Computer Paper,Anthony Johnson,10791,93.3600,19.98,5.77,Northwest Territories,Paper,0.38
98,100,600 Series Flip,Ralph Knight,10945,4.2210,95.99,8.99,Northwest Territories,Telephones and Communication,0.57